# Напишите функцию, которая преобразует входную строку в верхний регистр.


def make_upper_case(s):
    return s.upper()


print(make_upper_case("hello"))
