# Напишите класс Block, который создает блок (ну да...)
#
# Требования
# Конструктор должен принимать в качестве аргумента массив,
# содержащий 3 целых числа формы, [width, length, height]из которой Blockдолжен быть создан.


class Block:
    # Good Luck!


print(initials('Barack hussein obama'))
