# Бегун, который бежит с базовой скоростью sс продолжительностью, tпокроет расстояние d: d = s * t
# Однако этот бегун может бежать спринт в течение одной единицы времени с удвоенной скоростью s * 2
# . После спринта базовая скорость sнавсегда уменьшится на 1, а в течение следующей единицы времени бегун
# войдет в фазу восстановления и не сможет снова бежать спринт.
#
# Ваша задача, зная базовую скорость sи время t, найти максимально возможное расстояние d.


def solution(s, t):
    pass


print(solution(2, 3))
