# Бобу нужен быстрый способ вычисления объема прямоугольного параллелепипеда
# с использованием трех величин: length, widthи heightпараллелепипеда.
# Напишите функцию, которая поможет Бобу с этим вычислением.


def get_volume_of_cuboid(length, width, height):
    return length * width * height


print(get_volume_of_cuboid(1, 2, 2))

