"""
Напишите функцию для разбиения строки и преобразования ее в массив слов.
Link: https://www.codewars.com/kata/57e76bc428d6fbc2d500036d
"""


def string_to_array(s):
    return s.split(" ")


print(string_to_array(""))
