# Напишите функцию для разбиения строки и преобразования ее в массив слов.


def string_to_array(s):
    return s.split(" ")


print(string_to_array(""))
